DataProcessors/СогласованиеПредстоящихРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СогласованиеПредстоящихРасходов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СтатусыПорученийНаПереводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПорученийНаПереводДенежныхСредств</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПорученийНаПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПоручениеНаПереводДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АкцептованиеОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АкцептованиеОпераций</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Акцептант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеКредитногоИнструмента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаСВалютой</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАкцепта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАкцептов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыПередачиПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыПередачиПоручений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БумажныйНоситель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефоннаяСвязь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГолосоваяИнформация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстовоеСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидеоСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяСистема</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоручениеНаПереводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоручениеНаПереводДенежныхСредств</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрокерПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрочныйПереводБЭСП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучательСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоручениеНаДвижениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.НачислениеЗадолженности</xr:Item>
				<xr:Item>Document.ПогашениеПаев</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствамПоПоручениям</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиВозвратаДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводВсехАктивов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПередачиПоручений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезАгента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоручениеНаПереводМеждуСчетамиДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДоговорТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеПаев</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/СогласованиеПредстоящихРасходов/Forms/ИсполнениеПоручений/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.Дата = ТекущаяДата();
	ЭтаФорма.ДатаПорученийНаПеревод = ЭтаФорма.Дата;
		
	ОбновитьТаблицыПорученийНаВыводНаСервере();
	ОбновитьТаблицуПорученийНаПереводНаСервере();
					
КонецПроцедуры 

&НаСервере
Процедура ОбновитьТаблицыПорученийНаВыводНаСервере()
	
	ОбъектНаСервере          = РеквизитФормыВЗначение("Объект");
	ТаблицаПорученияКлиентов = РеквизитФормыВЗначение("ПорученияКлиентов");
	ТаблицаВнутренниеПорученияНаВывод = РеквизитФормыВЗначение("ВнутренниеПорученияНаВывод");
	
	ТаблицаПорученияКлиентов.Очистить();
	ТаблицаВнутренниеПорученияНаВывод.Очистить();
	
	МВТ = ОбъектНаСервере.ПолучитьДанныеПоПоручениям(ЭтаФорма.Организация, ЭтаФорма.Дата);
	
	ДанныеНаСервере = СформироватьДанныеТаблицы(МВТ, ЭтаФорма.Организация, ЭтаФорма.Дата);
					 
	Для Каждого СтрокаДанных Из ДанныеНаСервере Цикл
		
		Если СтрокаДанных.ВнутреннееПоручение Тогда
			
			НоваяСтрокаТаблицы = ТаблицаВнутренниеПорученияНаВывод.Добавить();
			
			Если ЗначениеЗаполнено(СтрокаДанных.Поручение) Тогда
				НоваяСтрокаТаблицы.НомерДатаПоручения = СокрЛП(СтрокаДанных.Поручение.Номер) + " от " + Формат(СтрокаДанных.Поручение.Дата, "ДФ=dd.MM.yyyy");
			КонецЕсли;
		Иначе	
		
			НоваяСтрокаТаблицы = ТаблицаПорученияКлиентов.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаДанных);

	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаПорученияКлиентов, "ПорученияКлиентов");
	ЗначениеВРеквизитФормы(ТаблицаВнутренниеПорученияНаВывод, "ВнутренниеПорученияНаВывод");
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьТаблицуПорученийНаПереводНаСервере()
	
	ТаблицаПорученийНаПереводДС = РеквизитФормыВЗначение("ПорученияНаПереводДенежныхСредств");
	ТаблицаПорученийНаПереводДС.Очистить();
	
	Запрос = Новый Запрос;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛОЖЬ КАК Флажок,
		|	ДокПоручение.Ссылка КАК Поручение,
		|	ДокПоручение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ДокПоручение.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА ДокПоручение.БрокерПолучатель = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|						ТОГДА ВЫБОР
		|								КОГДА ДокПоручение.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
		|									ТОГДА 4
		|								КОГДА ДокПоручение.МестоХраненияПолучатель = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
		|									ТОГДА 5
		|								ИНАЧЕ 3
		|							КОНЕЦ
		|					ИНАЧЕ 1
		|				КОНЕЦ
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ТипПорученияНаПеревод,
		|	ДокПоручение.Сумма КАК Сумма,
		|	ДокПоручение.Валюта КАК Валюта,
		|	ДокПоручение.СрочныйПереводБЭСП КАК БЭСП,
		|	ВЫБОР
		|		КОГДА ДокПоручение.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ДокПоручение.РасчетныйСчет.Банк
		|		ИНАЧЕ ДокПоручение.Брокер
		|	КОНЕЦ КАК БрокерБанк,
		|	ДокПоручение.МестоХранения КАК МестоХранения,
		|	ДокПоручение.РасчетныйСчет КАК РасчетныйСчет,
		|	ВЫБОР
		|		КОГДА ДокПоручение.БрокерПолучатель = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ДокПоручение.РасчетныйСчетПолучатель.Банк
		|		ИНАЧЕ ДокПоручение.БрокерПолучатель
		|	КОНЕЦ КАК БрокерБанкПолучатель,
		|	ДокПоручение.МестоХраненияПолучатель КАК МестоХраненияПолучатель,
		|	ДокПоручение.РасчетныйСчетПолучатель КАК РасчетныйСчетПолучатель,
		|	СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.Статус КАК Статус
		|ПОМЕСТИТЬ _ПорученияНаПереводДС
		|ИЗ
		|	Документ.ПоручениеНаПереводДенежныхСредств КАК ДокПоручение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПорученийНаПереводДенежныхСредств.СрезПоследних КАК СтатусыПорученийНаПереводДенежныхСредствСрезПоследних
		|		ПО ДокПоручение.Ссылка = СтатусыПорученийНаПереводДенежныхСредствСрезПоследних.ПоручениеНаПереводДенежныхСредств
		|ГДЕ
		|	ДокПоручение.Проведен
		|	И ДокПоручение.Организация = &Организация
		|	И НАЧАЛОПЕРИОДА(ДокПоручение.Дата, ДЕНЬ) = &ДатаПорученийНаПеревод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПорученияНаПереводДС.Поручение КАК Поручение,
		|	ПереводыДенежныхСредств.Проведен КАК Проведен,
		|	ПереводыДенежныхСредств.Сумма КАК Сумма
		|ПОМЕСТИТЬ _ИсполненныеПоручения
		|ИЗ
		|	_ПорученияНаПереводДС КАК _ПорученияНаПереводДС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПереводДенежныхСредств.Основание КАК Основание,
		|			МАКСИМУМ(ПереводДенежныхСредств.Проведен) КАК Проведен,
		|			СУММА(ВЫБОР
		|					КОГДА ПереводДенежныхСредств.Проведен
		|						ТОГДА ПереводДенежныхСредств.Сумма
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК Сумма
		|		ИЗ
		|			Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
		|		ГДЕ
		|			НЕ ПереводДенежныхСредств.ПометкаУдаления
		|			И ПереводДенежныхСредств.Основание В
		|					(ВЫБРАТЬ
		|						_ПорученияНаПереводДС.Поручение
		|					ИЗ
		|						_ПорученияНаПереводДС КАК _ПорученияНаПереводДС)
		|			И ПереводДенежныхСредств.Дата >= &ДатаПорученийНаПеревод
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПереводДенежныхСредств.Основание) КАК ПереводыДенежныхСредств
		|		ПО _ПорученияНаПереводДС.Поручение = ПереводыДенежныхСредств.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПорученияНаПереводДС.Флажок КАК Флажок,
		|	_ПорученияНаПереводДС.Поручение КАК Поручение,
		|	_ПорученияНаПереводДС.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ПорученияНаПереводДС.ТипПорученияНаПеревод КАК ТипПорученияНаПеревод,
		|	_ПорученияНаПереводДС.Сумма КАК Сумма,
		|	_ПорученияНаПереводДС.Валюта КАК Валюта,
		|	_ПорученияНаПереводДС.БЭСП КАК БЭСП,
		|	_ПорученияНаПереводДС.БрокерБанк КАК БрокерБанк,
		|	_ПорученияНаПереводДС.МестоХранения КАК МестоХранения,
		|	_ПорученияНаПереводДС.РасчетныйСчет КАК РасчетныйСчет,
		|	_ПорученияНаПереводДС.БрокерБанкПолучатель КАК БрокерБанкПолучатель,
		|	_ПорученияНаПереводДС.МестоХраненияПолучатель КАК МестоХраненияПолучатель,
		|	_ПорученияНаПереводДС.РасчетныйСчетПолучатель КАК РасчетныйСчетПолучатель,
		|	_ПорученияНаПереводДС.Статус КАК Статус,
		|	ВЫБОР
		|		КОГДА НЕ _ИсполненныеПоручения.Поручение ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА _ИсполненныеПоручения.Проведен
		|						ТОГДА ВЫБОР
		|								КОГДА _ИсполненныеПоручения.Сумма = _ПорученияНаПереводДС.Сумма
		|									ТОГДА ""Проведен""
		|								ИНАЧЕ ""Исполнен частично""
		|							КОНЕЦ
		|					ИНАЧЕ ""Записан""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК СтатусПеревода
		|ИЗ
		|	_ПорученияНаПереводДС КАК _ПорученияНаПереводДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ИсполненныеПоручения КАК _ИсполненныеПоручения
		|		ПО _ПорученияНаПереводДС.Поручение = _ИсполненныеПоручения.Поручение";
#КонецОбласти

	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("ДатаНачалаКонтроляАкцептов", РаботаСДокументами.ДатаНачалаКонтроляАкцептов());
	Запрос.УстановитьПараметр("ДатаПорученийНаПеревод", ЭтаФорма.ДатаПорученийНаПеревод);
	
	ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "ПорученияНаПереводДенежныхСредств");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьДанныеТаблицы(МенеджерВТ, Организация, Дата) 
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Поручения.Ссылка КАК Ссылка,
		|	_Поручения.Организация КАК Организация,
		|	_Поручения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Поручения.Основание КАК Основание,
		|	_Поручения.Валюта КАК Валюта,
		|	_Поручения.Сумма КАК Сумма,
		|	_Поручения.РасчетныйСчет КАК РасчетныйСчет,
		|	_Поручения.РасчетныйСчетПолучатель КАК РасчетныйСчетПолучатель,
		|	_Поручения.ДатаИсполненияС КАК ДатаИсполненияС,
		|	_Поручения.ДатаИсполненияПо КАК ДатаИсполненияПо,
		|	_Поручения.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	_Поручения.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	_Поручения.Отменено КАК Отменено,
		|	_Поручения.Исполнено КАК Исполнено,
		|	_Поручения.ВыводВсехАктивов КАК ВыводВсехАктивов,
		|	_Поручения.СуммаЗадолженностиОстаток КАК СуммаЗадолженностиОстаток,
		|	_Поручения.СпособПередачи = ЗНАЧЕНИЕ(Перечисление.СпособыПередачиПоручений.ВнутренняяСистема) КАК ВнутреннееПоручение,
		|	_Поручения.ТипЗадолженности КАК ТипЗадолженности,
		|	_Поручения.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ _ПорученияУчетнойСистемы
		|ИЗ
		|	_Поручения КАК _Поручения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НачисленияЗадолженности.ДатаНачисления КАК ДатаНачисления,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_ПорученияУчетнойСистемы.ВнутреннееПоручение, ИСТИНА)
		|			ТОГДА _НачисленияЗадолженности.Контрагент
		|		ИНАЧЕ _ПорученияУчетнойСистемы.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	_НачисленияЗадолженности.Договор КАК Договор,
		|	_ПорученияУчетнойСистемы.ВыводВсехАктивов КАК ВыводВсехАктивов,
		|	_ПорученияУчетнойСистемы.Ссылка КАК Поручение,
		|	ЕСТЬNULL(_НачисленияЗадолженности.Организация, _ПорученияУчетнойСистемы.Организация) КАК Организация,
		|	ЕСТЬNULL(_НачисленияЗадолженности.СчетДоверительногоУправления, _ПорученияУчетнойСистемы.СчетДоверительногоУправления) КАК СчетДоверительногоУправления,
		|	ЕСТЬNULL(_НачисленияЗадолженности.Валюта, _ПорученияУчетнойСистемы.Валюта) КАК Валюта,
		|	ЕСТЬNULL(_НачисленияЗадолженности.СуммаЗадолженности, _ПорученияУчетнойСистемы.Сумма) КАК Сумма,
		|	ЕСТЬNULL(_НачисленияЗадолженности.ОснованиеПоручения, _ПорученияУчетнойСистемы.Основание) КАК Основание,
		|	ЕСТЬNULL(_НачисленияЗадолженности.ВидЗадолженности, ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка)) КАК ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_ПорученияУчетнойСистемы.ВнутреннееПоручение, ИСТИНА)
		|			ТОГДА ЕСТЬNULL(_НачисленияЗадолженности.РасчетныйСчетИзНастроекУчетаДоходовПоЦеннымБумагам, _ПорученияУчетнойСистемы.РасчетныйСчет)
		|		ИНАЧЕ _ПорученияУчетнойСистемы.РасчетныйСчет
		|	КОНЕЦ КАК РасчетныйСчет,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_ПорученияУчетнойСистемы.ВнутреннееПоручение, ИСТИНА)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|		ИНАЧЕ _ПорученияУчетнойСистемы.РасчетныйСчетПолучатель
		|	КОНЕЦ КАК РасчетныйСчетПолучатель,
		|	ЕСТЬNULL(_ПорученияУчетнойСистемы.Отменено, ЛОЖЬ) КАК Отменено,
		|	_ПорученияУчетнойСистемы.ДатаИсполненияС КАК ДатаИсполненияС,
		|	_ПорученияУчетнойСистемы.ДатаИсполненияПо КАК ДатаИсполненияПо,
		|	_ПорученияУчетнойСистемы.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	_ПорученияУчетнойСистемы.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	ЕСТЬNULL(_ПорученияУчетнойСистемы.ВнутреннееПоручение, ИСТИНА) КАК ВнутреннееПоручение,
		|	ЕСТЬNULL(_ПорученияУчетнойСистемы.ТипЗадолженности, ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)) КАК ТипЗадолженности,
		|	ВЫБОР
		|		КОГДА _ПорученияУчетнойСистемы.ДатаИсполненияПо >= &НачалоДня
		|			ТОГДА РАЗНОСТЬДАТ(&НачалоДня, _ПорученияУчетнойСистемы.ДатаИсполненияПо, ДЕНЬ)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоДнейДоКрайнейДатыИсполнения,
		|	ВЫБОР
		|		КОГДА _ПорученияУчетнойСистемы.Ссылка ЕСТЬ NULL
		|			ТОГДА ""ОЖИДАЕТ ПОРУЧЕНИЯ""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _ПорученияУчетнойСистемы.Отменено
		|					ТОГДА ""ОТМЕНЕНО""
		|				КОГДА _ПорученияУчетнойСистемы.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|					ТОГДА ВЫБОР
		|							КОГДА _ПодчиненныеДокументы.Поручение ЕСТЬ NULL
		|								ТОГДА ""СОГЛАСОВАНИЕ НЕ ТРЕБУЕТСЯ""
		|							ИНАЧЕ ВЫБОР
		|									КОГДА _ПодчиненныеДокументы.ЕстьСтрокаБанковскойВыписки
		|										ТОГДА ""ИСПОЛНЕНО""
		|									ИНАЧЕ ""В ОБРАБОТКЕ""
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОГДА АкцептованиеОперацийСрезПоследних.Операция ЕСТЬ NULL
		|					ТОГДА ""ПОРУЧЕНИЕ НА СОГЛАСОВАНИИ""
		|				КОГДА _ПодчиненныеДокументы.Поручение ЕСТЬ NULL
		|					ТОГДА ""ПОРУЧЕНИЕ СОГЛАСОВАНО""
		|				ИНАЧЕ ВЫБОР
		|						КОГДА _ПодчиненныеДокументы.ЕстьСтрокаБанковскойВыписки
		|							ТОГДА ВЫБОР
		|									КОГДА _ПорученияУчетнойСистемы.ВыводВсехАктивов
		|										ТОГДА ВЫБОР
		|												КОГДА _ПорученияУчетнойСистемы.Исполнено
		|													ТОГДА ""ИСПОЛНЕНО""
		|												ИНАЧЕ ""ЧАСТИЧНО ИСПОЛНЕНО""
		|											КОНЕЦ
		|									ИНАЧЕ ВЫБОР
		|											КОГДА _ПорученияУчетнойСистемы.СуммаЗадолженностиОстаток <> 0
		|												ТОГДА ""ЧАСТИЧНО ИСПОЛНЕНО""
		|											ИНАЧЕ ""ИСПОЛНЕНО""
		|										КОНЕЦ
		|								КОНЕЦ
		|						ИНАЧЕ ""В ОБРАБОТКЕ""
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Статус
		|ИЗ
		|	_ПорученияУчетнойСистемы КАК _ПорученияУчетнойСистемы
		|		ПОЛНОЕ СОЕДИНЕНИЕ _НачисленияЗадолженности КАК _НачисленияЗадолженности
		|		ПО _ПорученияУчетнойСистемы.Основание = _НачисленияЗадолженности.ОснованиеПоручения
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПодчиненныеДокументы КАК _ПодчиненныеДокументы
		|		ПО _ПорученияУчетнойСистемы.Ссылка = _ПодчиненныеДокументы.Поручение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АкцептованиеОпераций.СрезПоследних(
		|				&КонецДня,
		|				Организация = &Организация
		|					И ВидАкцепта = ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.ПоручениеНаВыводАктивов)) КАК АкцептованиеОперацийСрезПоследних
		|		ПО _ПорученияУчетнойСистемы.Ссылка = АкцептованиеОперацийСрезПоследних.Операция
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЕСТЬNULL(_НачисленияЗадолженности.ВидЗадолженности, ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("НачалоДня", Дата);
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

&НаСервере
Процедура КомандаОтменитьПорученияНаСервере(МассивДанных)
	
	Механизм = Метаданные.Обработки.СогласованиеПредстоящихРасходов.Имя + ".Форма.ИсполнениеПоручений.КомандаОтменитьПорученияНаСервере()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Дата, Организация");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
			
	Для Каждого ПоручениеСсылка Из МассивДанных Цикл
		
		РаботаСБизнесПроцессамиИЗадачами.ЗавершитьБизнесПроцессИОтменитьПоручение(ЭтотОбъект.Организация, ПоручениеСсылка, Ложь); 
										
	КонецЦикла;
	
	ОбновитьТаблицыПорученийНаВыводНаСервере();
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия, Новый Структура("КоличествоОтмененныхПоручений", МассивДанных.Количество()));
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьДокументыНаСервере(ИмяКоманды, МассивДанных)
	
	Механизм = Метаданные.Обработки.СогласованиеПредстоящихРасходов.Имя + ".Форма.ИсполнениеПоручений.СоздатьДокументыНаСервере()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Дата, Организация", Новый Структура("Команда, КоличествоНовыхДокументов", ИмяКоманды, МассивДанных.Количество()));
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ОписаниеОшибок = "";
	
	Для Каждого СтрокаТаблицыДанных Из МассивДанных Цикл 
		
		Если ИмяКоманды = "СоздатьВнутренниеПоручения" Тогда 
			
			НовыйДокумент = Документы.ПоручениеНаДвижениеДенежныхСредств.СоздатьДокумент();
			
			ЗаполнитьЗначенияСвойств(НовыйДокумент, СтрокаТаблицыДанных);

			НовыйДокумент.Дата = ТекущаяДатаСеанса();
			НовыйДокумент.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская;
			НовыйДокумент.СпособПередачи = Перечисления.СпособыПередачиПоручений.ВнутренняяСистема;
			
			Если Не ЗначениеЗаполнено(НовыйДокумент.ДатаИсполненияС) Тогда
				НовыйДокумент.ДатаИсполненияС  = НовыйДокумент.Дата;
				НовыйДокумент.ДатаИсполненияПо = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НовыйДокумент.ДатаИсполненияС, 5);
			КонецЕсли;
	
		ИначеЕсли ИмяКоманды = "СоздатьОплаты" Тогда
			
			НовыйДокумент = Документы.Оплата.СоздатьДокумент(); 
			
			ЗаполнитьЗначенияСвойств(НовыйДокумент, СтрокаТаблицыДанных);
			
			НовыйДокумент.Дата = ТекущаяДатаСеанса();
			НовыйДокумент.ВидДвижения = Перечисления.ВидыДвижений.Расход;
			НовыйДокумент.ВалютаОплаты = СтрокаТаблицыДанных.Валюта;
			НовыйДокумент.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок; 
			
			ОснованиеОплаты = НовыйДокумент.Основания.Добавить();
			ЗаполнитьЗначенияСвойств(ОснованиеОплаты, СтрокаТаблицыДанных);
			ОснованиеОплаты.СуммаОплаты = СтрокаТаблицыДанных.Сумма;
	
		ИначеЕсли ИмяКоманды = "СоздатьВнутренниеВыводы" Или ИмяКоманды = "СоздатьКлиентскиеВыводы" Или ИмяКоманды = "СоздатьКлиентскиеВводы" Тогда 
			
			Если ИмяКоманды = "СоздатьКлиентскиеВводы" Тогда
				НовыйДокумент = Документы.ВводДенежныхСредств.СоздатьДокумент();
			Иначе
				НовыйДокумент = Документы.ВыводДенежныхСредств.СоздатьДокумент();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НовыйДокумент, СтрокаТаблицыДанных);
			
			НовыйДокумент.Дата = ТекущаяДатаСеанса();
			НовыйДокумент.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная;
			
			Если ЗначениеЗаполнено(СтрокаТаблицыДанных.ВидОперации) Тогда
				НовыйДокумент.КоррСчет = БухгалтерскийУчет.ОпределитьСчетРасчетовПоДоговоруДоверительногоУправления(НовыйДокумент.Дата, НовыйДокумент.Дата, НовыйДокумент.СчетДоверительногоУправления, НовыйДокумент.ВидОперации);
			КонецЕсли;
			
			НовыйДокумент.КонтрагентДоговорТекстом = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицыДанных.Основание, "КонтрагентДоговорТекстом");
							
		ИначеЕсли ИмяКоманды = "СоздатьПереводыДенежныхСредств" Тогда
			
			НовыйДокумент = Документы.ПереводДенежныхСредств.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НовыйДокумент, СтрокаТаблицыДанных);
			
			НовыйДокумент.Дата = ТекущаяДатаСеанса();
			НовыйДокумент.МестоХранения = Справочники.МестаХранения.ВнебиржевойРынок;
			НовыйДокумент.ВариантПеревода = Перечисления.ВариантыПереводаДенежныхСредств.Перевод;
			НовыйДокумент.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная;
			НовыйДокумент.ФормаДенежныхСредствПолучатель = Перечисления.ФормыДенежныхСредств.Безналичная;
			
		КонецЕсли;

		НовыйДокумент.Организация = ЭтотОбъект.Организация;	
		НовыйДокумент.Ответственный = РаботаСПользователями.ТекущийПользователь();
	
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 	
		Исключение
			ТекстОшибки = "Не удалось провести документ на сумму " + СтрокаТаблицыДанных.Сумма + ". Счет доверительного управления " + СтрокаТаблицыДанных.СчетДоверительногоУправления + Символы.ПС + ОписаниеОшибки(); 
			ОписаниеОшибок = ОписаниеОшибок + ТекстОшибки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);   
		КонецПопытки;	
				
	КонецЦикла;
	
	Если ИмяКоманды = "СоздатьПереводыДенежныхСредств" Тогда
		ОбновитьТаблицуПорученийНаПереводНаСервере();
	Иначе
		ОбновитьТаблицыПорученийНаВыводНаСервере(); 
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия, ?(ОписаниеОшибок <> "", Новый Структура("Ошибка", ОписаниеОшибок), Неопределено));
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьПоручениеКлиента(Команда)
	
	ОткрытьФорму("Документ.ПоручениеНаДвижениеДенежныхСредств.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКлиентскиеВыводы(Команда)
	
	СформироватьДанныеИВыполнитьКоманду(Команда.Имя, "ПорученияКлиентов");
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьКлиентскиеВводы(Команда)
	
	СформироватьДанныеИВыполнитьКоманду(Команда.Имя, "ПорученияКлиентов");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВнутренниеПоручения(Команда)
	
	СформироватьДанныеИВыполнитьКоманду(Команда.Имя, "ВнутренниеПорученияНаВывод");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОплаты(Команда) 
		
	СформироватьДанныеИВыполнитьКоманду(Команда.Имя, "ВнутренниеПорученияНаВывод");
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьВнутренниеВыводы(Команда)
	
	СформироватьДанныеИВыполнитьКоманду(Команда.Имя, "ВнутренниеПорученияНаВывод");

КонецПроцедуры 

&НаКлиенте
Процедура СоздатьПереводыДенежныхСредств(Команда)
	
	СформироватьДанныеИВыполнитьКоманду(Команда.Имя, "ПорученияНаПереводДенежныхСредств");	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВнутренниеПоручения(Команда) 
		
	СформироватьДанныеИВыполнитьКоманду(Команда.Имя, "ВнутренниеПорученияНаВывод");
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДанныеИВыполнитьКоманду(ИмяКоманды, ИмяТаблицы) 
	
	ТекущиеСтатусы = Новый Массив;
	
	Если ИмяКоманды = "СоздатьВнутренниеПоручения" Тогда
		
		ТекущиеСтатусы.Добавить("ОЖИДАЕТ ПОРУЧЕНИЯ");
		
	ИначеЕсли ИмяКоманды = "СоздатьОплаты" Или ИмяКоманды = "СоздатьКлиентскиеВыводы" Или ИмяКоманды = "СоздатьВнутренниеВыводы" Тогда
		
		ТекущиеСтатусы.Добавить("ПОРУЧЕНИЕ СОГЛАСОВАНО");
		
	ИначеЕсли ИмяКоманды = "ОтменитьВнутренниеПоручения" Тогда
		
		ТекущиеСтатусы.Добавить("ПОРУЧЕНИЕ НА СОГЛАСОВАНИИ");
		ТекущиеСтатусы.Добавить("ПОРУЧЕНИЕ СОГЛАСОВАНО");
		
	ИначеЕсли ИмяКоманды = "СоздатьКлиентскиеВводы" Тогда
		
		ТекущиеСтатусы.Добавить("СОГЛАСОВАНИЕ НЕ ТРЕБУЕТСЯ");
		
	ИначеЕсли ИмяКоманды = "СоздатьПереводыДенежныхСредств" Тогда
		ТекущиеСтатусы.Добавить("ОТПРАВЛЕНО");
		ТекущиеСтатусы.Добавить(""); //статус отсутствует если еще не сформировано уведомление для бэк-офиса.
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для команды [" + ИмяКоманды + "] не описан алгоритм действий.");
		Возврат;	
	КонецЕсли;
	
	МассивДанных = Новый Массив;
	
	Если ЭтаФорма[ИмяТаблицы].НайтиСтроки(Новый Структура("Флажок", Истина)).Количество() = 0 Тогда 
		
		Если ИмяКоманды = "СоздатьВнутренниеПоручения" Тогда
			
			Если Вопрос("Вы хотите создать новое поручение на предоставление денежных средств без начисления задолженности?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
					
				ДанныеПоручения = ОткрытьФормуМодально("Обработка.СогласованиеПредстоящихРасходов.Форма.ФормаСозданияНовогоДокумента", Новый Структура("Организация, ВидНовогоДокумента", ЭтаФорма.Организация, "Поручение"), ЭтаФорма);
				
				Если ДанныеПоручения <> Неопределено Тогда
					МассивДанных.Добавить(ДанныеПоручения);	
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите поручение для выполнения команды [" + ИмяКоманды + "].");		
			Возврат; 
		КонецЕсли;
				
	Иначе
		
		Для Каждого СтрокаТаблицыДанных Из ЭтаФорма[ИмяТаблицы] Цикл
			
			Если СтрокаТаблицыДанных.Флажок И Элементы[ИмяТаблицы].ПроверитьСтроку(СтрокаТаблицыДанных.ПолучитьИдентификатор()) Тогда
				
				Если ТекущиеСтатусы.Найти(ВРег(СтрокаТаблицыДанных.Статус)) <> Неопределено Тогда 
						
						ДанныеДокумента = СформироватьДанныеДокумента(ИмяКоманды, СтрокаТаблицыДанных);
						
						Если ДанныеДокумента <> Неопределено Тогда
							МассивДанных.Добавить(ДанныеДокумента);	
						КонецЕсли;
							
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя выполнить команду [" + ИмяКоманды + "] при текущем статусе поручения [" + СтрокаТаблицыДанных.Статус + "]");
					Продолжить;	
				КонецЕсли;
				
			КонецЕсли;
									
		КонецЦикла;
			
	КонецЕсли;

	Если МассивДанных.Количество() > 0 Тогда
		
		ПолеКлюча = "Поручение";
		
		Если ИмяТаблицы = "ВнутренниеПорученияНаВывод" И Элементы[ИмяТаблицы].ТекущиеДанные <> Неопределено Тогда
			ПолеКлюча = ?(ЗначениеЗаполнено(Элементы[ИмяТаблицы].ТекущиеДанные.Основание), "Основание", "Поручение");
		КонецЕсли;
		
		КлючТекущейСтроки = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы[ИмяТаблицы], ПолеКлюча);
		
		Если ИмяКоманды = "ОтменитьВнутренниеПоручения" Тогда	
			КомандаОтменитьПорученияНаСервере(МассивДанных);
		Иначе
			СоздатьДокументыНаСервере(ИмяКоманды, МассивДанных);
		КонецЕсли;
		
		РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма[ИмяТаблицы], Элементы[ИмяТаблицы], ПолеКлюча, КлючТекущейСтроки);
		
		Если ИмяКоманды = "СоздатьПереводыДенежныхСредств" Тогда
	
			Оповестить("ПорученияНаПереводДС.Обновить");	
			ОповеститьОбИзменении(Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств"));
			
		Иначе 
			Оповестить("СогласованиеПоручений.Обновить");
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьДанныеДокумента(ИмяКоманды, СтрокаТаблицыДанных) 
			
	Если ИмяКоманды = "ОтменитьВнутренниеПоручения" И ЗначениеЗаполнено(СтрокаТаблицыДанных.Поручение) Тогда
		
		Возврат СтрокаТаблицыДанных.Поручение;		
	
	КонецЕсли;
	
	ДанныеДокумента = Новый Структура("СчетДоверительногоУправления, Основание, Сумма, Валюта");
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, СтрокаТаблицыДанных); 
	
	Если Не (ИмяКоманды = "СоздатьВнутренниеПоручения" Или ИмяКоманды = "СоздатьОплаты") Тогда
		ДанныеДокумента.Основание = СтрокаТаблицыДанных.Поручение;	
	КонецЕсли;
	
	Если ИмяКоманды = "СоздатьВнутренниеПоручения" Тогда
		
		Если ЗначениеЗаполнено(СтрокаТаблицыДанных.РасчетныйСчет) Тогда
			
			ДанныеДокумента.Вставить("РасчетныйСчет", СтрокаТаблицыДанных.РасчетныйСчет);
			
			ВариантыОтветов = Новый СписокЗначений;
			ВариантыОтветов.Добавить(1, "Изменить");
			ВариантыОтветов.Добавить(2, "Нет");
			ВариантыОтветов.Добавить(0, "Отмена");
									
			Ответ = Вопрос("В новом поручении на сумму " + СтрокаТаблицыДанных.Сумма + " " + СтрокаТаблицыДанных.Валюта + " будут установлены значения реквизитов по умолчанию:
						|1. р/счет " + СтрокаТаблицыДанных.РасчетныйСчет + "
						|2. период исполнения 5 рабочих дней.
						|Вы хотите изменить р/счет и/или период исполнения?", ВариантыОтветов,,, "Счет ду " + СтрокаТаблицыДанных.СчетДоверительногоУправления + "."); 
		Иначе 
			
			ВариантыОтветов = Новый СписокЗначений;
			ВариантыОтветов.Добавить(1, "Выбрать р/с");
			ВариантыОтветов.Добавить(0, "Отмена");
									
			Ответ = Вопрос("Не удалось определить расчетный счет.", ВариантыОтветов,,, "Счет ду " + СтрокаТаблицыДанных.СчетДоверительногоУправления + ".");
			
		КонецЕсли;
				
		Если Ответ = 1 Тогда 
				
			ПараметрыФормы = Новый Структура("Организация, СчетДоверительногоУправления, Сумма, Валюта, РасчетныйСчет, ВидНовогоДокумента");
			ЗаполнитьЗначенияСвойств(ПараметрыФормы, ДанныеДокумента);
			ПараметрыФормы.Организация = ЭтаФорма.Организация;
			ПараметрыФормы.ВидНовогоДокумента = "Поручение";
				
			ДопДанныеДокумента = ОткрытьФормуМодально("Обработка.СогласованиеПредстоящихРасходов.Форма.ФормаСозданияНовогоДокумента", ПараметрыФормы, ЭтаФорма); 
			
			Если ДопДанныеДокумента = Неопределено Тогда	
				Возврат Неопределено;	
			Иначе 
				ДанныеДокумента.Вставить("ДатаИсполненияС", ДопДанныеДокумента.ДатаИсполненияС);
				ДанныеДокумента.Вставить("ДатаИсполненияПо", ДопДанныеДокумента.ДатаИсполненияПо);
				ДанныеДокумента.Вставить("РасчетныйСчет", ДопДанныеДокумента.РасчетныйСчет);
			КонецЕсли;
			
		ИначеЕсли Ответ = 0 Тогда
			Возврат Неопределено;		
		КонецЕсли;
		
		Возврат ДанныеДокумента;
			
		//Иначе
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для счета ДУ [" + СтрокаТаблицыДанных.СчетДоверительногоУправления + "] нельзя создавать поручение на движение денежных средств, т.к. не указан расчетный счет.");	
		//	Возврат Неопределено;	
		//КонецЕсли;
		
	ИначеЕсли ИмяКоманды = "СоздатьОплаты" Тогда 
		
		// без задолженности можно создать оплату - аванс, либо вывод денежных средств 
		Если ЗначениеЗаполнено(СтрокаТаблицыДанных.ВидЗадолженности) Тогда 
			
			ДанныеДокумента.Вставить("РасчетныйСчет", СтрокаТаблицыДанных.РасчетныйСчет);		                                                                                                 
			ДанныеДокумента.Вставить("ВидЗадолженности", СтрокаТаблицыДанных.ВидЗадолженности);							
			ДанныеДокумента.Вставить("Контрагент", СтрокаТаблицыДанных.Контрагент);		
			ДанныеДокумента.Вставить("Договор", СтрокаТаблицыДанных.Договор);
			
			ВариантыОтветов = Новый СписокЗначений;
			ВариантыОтветов.Добавить(1, "Заполнить");
			ВариантыОтветов.Добавить(2, "Оставить пустым");
			ВариантыОтветов.Добавить(0, "Отмена");
			
			Ответ = Вопрос("Контрагент: " + СтрокаТаблицыДанных.Контрагент + "", ВариантыОтветов,, 0, "Заполнить расчетный счет контрагента в документе?");

			Если Ответ = 1 Тогда
				
				ПараметрыФормы = Новый Структура("Организация, Сумма, Валюта, ВидЗадолженности, Контрагент, Договор, ВидНовогоДокумента");
		
				ЗаполнитьЗначенияСвойств(ПараметрыФормы, СтрокаТаблицыДанных);
				ПараметрыФормы.Организация = ЭтаФорма.Организация;
				ПараметрыФормы.ВидНовогоДокумента = "Оплата";
				
				ДопДанныеДокумента = ОткрытьФормуМодально("Обработка.СогласованиеПредстоящихРасходов.Форма.ФормаСозданияНовогоДокумента", ПараметрыФормы, ЭтаФорма);
				
				Если ДопДанныеДокумента = Неопределено Тогда
					Возврат Неопределено;	
				Иначе
					ДанныеДокумента.Вставить("РасчетныйСчетКонтрагента", ДопДанныеДокумента.РасчетныйСчетПолучатель);
				КонецЕсли;
				
			ИначеЕсли Ответ = 0 Тогда
				
				Возврат Неопределено;
				
			КонецЕсли;
	
		Иначе
			
			Если Вопрос("Вы хотите создать [оплату - аванс] на основании поручения? Счет ДУ [" + СтрокаТаблицыДанных.СчетДоверительногоУправления + "]", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				
				ДанныеДокумента.Вставить("РасчетныйСчет", СтрокаТаблицыДанных.РасчетныйСчет);	
				ДанныеДокумента.Вставить("Поручение", СтрокаТаблицыДанных.Поручение);
				ДанныеДокумента.Вставить("Аванс", Истина);
				
				ПараметрыФормы = Новый Структура("Организация, Сумма, Валюта, ВидНовогоДокумента");
		
				ЗаполнитьЗначенияСвойств(ПараметрыФормы, СтрокаТаблицыДанных);
				ПараметрыФормы.Организация = ЭтаФорма.Организация;
				ПараметрыФормы.ВидНовогоДокумента = "ОплатаАванс";
				
				ДопДанныеДокумента = ОткрытьФормуМодально("Обработка.СогласованиеПредстоящихРасходов.Форма.ФормаСозданияНовогоДокумента", ПараметрыФормы, ЭтаФорма);
				
				Если ДопДанныеДокумента = Неопределено Тогда
					
					Возврат Неопределено;
					
				Иначе
					 
					ДанныеДокумента.Вставить("ВидЗадолженности", ДопДанныеДокумента.ВидЗадолженности);
					ДанныеДокумента.Вставить("Контрагент", ДопДанныеДокумента.Контрагент);		
					ДанныеДокумента.Вставить("Договор", ДопДанныеДокумента.Договор);
					ДанныеДокумента.Вставить("РасчетныйСчетКонтрагента", ДопДанныеДокумента.РасчетныйСчетПолучатель);
															
				КонецЕсли;
				
			Иначе	
				Возврат Неопределено;
			КонецЕсли;
			
		КонецЕсли;
			
	ИначеЕсли ИмяКоманды = "СоздатьКлиентскиеВыводы" Или ИмяКоманды = "СоздатьКлиентскиеВводы" Или ИмяКоманды = "СоздатьВнутренниеВыводы" Тогда 
		
		Если ИмяКоманды = "СоздатьВнутренниеВыводы" И ЗначениеЗаполнено(СтрокаТаблицыДанных.ВидЗадолженности) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создавать выводы денежных средств на основании поручений на движение денежных средств созданных на основании начисления задолженности.");
			Возврат Неопределено;
			
		Иначе
				
			ДанныеДокумента.Вставить("РасчетныйСчет", СтрокаТаблицыДанных.РасчетныйСчет);
			ДанныеДокумента.Вставить("Контрагент", СтрокаТаблицыДанных.Контрагент);
				
			Если ИмяКоманды = "СоздатьКлиентскиеВыводы" Или ИмяКоманды = "СоздатьКлиентскиеВводы" Тогда 
				
				ДанныеДокумента.Вставить("РасчетныйСчетКонтрагента", СтрокаТаблицыДанных.РасчетныйСчетПолучатель);
				ДанныеДокумента.Вставить("НомерВходящегоДокумента", СтрокаТаблицыДанных.НомерВходящегоДокумента);
				ДанныеДокумента.Вставить("ДатаВходящегоДокумента", СтрокаТаблицыДанных.ДатаВходящегоДокумента);
				
			КонецЕсли;

			ПараметрыФормы = Новый Структура("Организация, СчетДоверительногоУправления, Сумма, Валюта, РасчетныйСчет, РасчетныйСчетПолучатель, Контрагент, ВидНовогоДокумента");
		
			ЗаполнитьЗначенияСвойств(ПараметрыФормы, СтрокаТаблицыДанных);
			ПараметрыФормы.Организация = ЭтаФорма.Организация;
			ПараметрыФормы.ВидНовогоДокумента = ?(ИмяКоманды = "СоздатьКлиентскиеВводы", "ВводДенежныхСредств", "ВыводДенежныхСредств");
			
			ДопДанныеДокумента = ОткрытьФормуМодально("Обработка.СогласованиеПредстоящихРасходов.Форма.ФормаСозданияНовогоДокумента", ПараметрыФормы, ЭтаФорма);
			
			Если ДопДанныеДокумента = Неопределено Тогда
				
				Возврат Неопределено;
				
			Иначе
				
				ДанныеДокумента.Вставить("ВидОперации", ДопДанныеДокумента.ВидОперации);
				ДанныеДокумента.Вставить("Контрагент", ДопДанныеДокумента.Контрагент);
				
				Если ИмяКоманды = "СоздатьКлиентскиеВводы" Тогда
					ДанныеДокумента.Вставить("РасчетныйСчет", ДопДанныеДокумента.РасчетныйСчетПолучатель);
					ДанныеДокумента.Вставить("РасчетныйСчетКонтрагента", ДопДанныеДокумента.РасчетныйСчет);
				Иначе
					ДанныеДокумента.Вставить("РасчетныйСчет", ДопДанныеДокумента.РасчетныйСчет);
					ДанныеДокумента.Вставить("РасчетныйСчетКонтрагента", ДопДанныеДокумента.РасчетныйСчетПолучатель);
				КонецЕсли;
				
			КонецЕсли;

		КонецЕсли;
		
	ИначеЕсли ИмяКоманды = "СоздатьПереводыДенежныхСредств" Тогда 
		
		Если СтрокаТаблицыДанных.ТипПорученияНаПеревод = 2 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для неторговых поручений создание переводов не требуется.");
			Возврат Неопределено;	
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаТаблицыДанных.СтатусПеревода) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На основании поручения уже создан перевод денежных средств.");
			Возврат Неопределено;	
		КонецЕсли;
		
	    ДанныеДокумента.Вставить("РасчетныйСчет", СтрокаТаблицыДанных.РасчетныйСчет);
		ДанныеДокумента.Вставить("РасчетныйСчетПолучатель", СтрокаТаблицыДанных.РасчетныйСчетПолучатель);
        ДанныеДокумента.Вставить("МестоХраненияПолучатель",  СтрокаТаблицыДанных.МестоХраненияПолучатель); 
		ДанныеДокумента.Вставить("БрокерПолучатель",  СтрокаТаблицыДанных.БрокерБанкПолучатель);
			
	КонецЕсли; 
	
	Возврат ДанныеДокумента;
			
КонецФункции

&НаКлиенте
Процедура ОбновитьТаблицыПорученийНаВывод(Команда)
	
	ОбновитьТаблицыПоручений(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуПорученийНаПеревод(Команда)
	
	ОбновитьТаблицыПоручений(Команда.Имя); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицыПоручений(ИмяКоманды) 
	
	ПолеКлюча = "Поручение";
	КлючТекущейСтроки = Неопределено;
	
	Если ИмяКоманды = "ОбновитьТаблицыПорученийНаВывод" Тогда
		
		ИмяТаблицы = "ПорученияКлиентов";
		
		Если Элементы.ГруппаСтраницыПорученийНаВывод.ТекущаяСтраница = Элементы.Внутренние Тогда
			
			ИмяТаблицы = "ВнутренниеПорученияНаВывод";
			
			Если Элементы[ИмяТаблицы].ТекущиеДанные <> Неопределено Тогда
				ПолеКлюча = ?(ЗначениеЗаполнено(Элементы[ИмяТаблицы].ТекущиеДанные.Основание), "Основание", "Поручение");
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяКоманды = "ОбновитьТаблицуПорученийНаПеревод" Тогда
    	ИмяТаблицы = "ПорученияНаПереводДенежныхСредств";
	Иначе
		Возврат;
	КонецЕсли;
		
 	Если ЭтаФорма[ИмяТаблицы].Количество() > 0 Тогда
		КлючТекущейСтроки = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы[ИмяТаблицы], ПолеКлюча);
	КонецЕсли;
	
	Если ИмяКоманды = "ОбновитьТаблицыПорученийНаВывод" Тогда
		ОбновитьТаблицыПорученийНаВыводНаСервере();	
	ИначеЕсли ИмяКоманды = "ОбновитьТаблицуПорученийНаПеревод" Тогда 
		ОбновитьТаблицуПорученийНаПереводНаСервере();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючТекущейСтроки) Тогда
		РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма[ИмяТаблицы], Элементы[ИмяТаблицы], ПолеКлюча, КлючТекущейСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиТаблицыКлиентские(Команда)
	
	ИзменитьЗначенияФлажков("ПорученияКлиентов", Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура СнятьФлажкиТаблицыКлиентские(Команда)
	
	ИзменитьЗначенияФлажков("ПорученияКлиентов", Ложь); 
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьФлажкиТаблицыВнутренние(Команда)
	
	ИзменитьЗначенияФлажков("ВнутренниеПорученияНаВывод", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиТаблицыВнутренние(Команда)
	
	ИзменитьЗначенияФлажков("ВнутренниеПорученияНаВывод", Ложь); 
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьФлажкиТаблицыПорученийНаПеревод(Команда)
	
	ИзменитьЗначенияФлажков("ПорученияНаПереводДенежныхСредств", Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиТаблицыПорученийНавывод(Команда)
	
	ИзменитьЗначенияФлажков("ПорученияНаПереводДенежныхСредств", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗначенияФлажков(ИмяТаблицы, Значение);
	
	Для Каждого СтрокаТаблицыДанных Из ЭтаФорма[ИмяТаблицы] Цикл 
			
		Если (СтрокаТаблицыДанных.Статус = "ОЖИДАЕТ ПОРУЧЕНИЯ" 
				Или СтрокаТаблицыДанных.Статус = "ПОРУЧЕНИЕ СОГЛАСОВАНО" 
				Или СтрокаТаблицыДанных.Статус = "ПОРУЧЕНИЕ НА СОГЛАСОВАНИИ"
				Или (ИмяТаблицы = "ПорученияНаПереводДенежныхСредств" И СтрокаТаблицыДанных.ТипПорученияНаПеревод <> 2)) 
				И (Значение = Ложь Или Элементы[ИмяТаблицы].ПроверитьСтроку(СтрокаТаблицыДанных.ПолучитьИдентификатор())) Тогда
			
			СтрокаТаблицыДанных.Флажок = Значение;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаДанныхОбработкаНажатия(Элемент, Отказ)
	
	ИмяТаблицы = Элемент.Имя;	
	ТекущиеДанные = Элемент.ТекущиеДанные; 
		
	Если ТекущиеДанные = Неопределено Или Элемент.ТекущийЭлемент = Неопределено Или Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "Флажок" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "СчетДоверительногоУправления" Тогда
		
		ОткрытьЗначение(ТекущиеДанные.СчетДоверительногоУправления);
		
	Иначе
		
		Если ИмяТаблицы = "ВнутренниеПорученияНаВывод" Тогда 
			
			Если (Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "ВидЗадолженности"
				Или Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "ДатаНачисления"
				Или Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "Контрагент")
					И ЗначениеЗаполнено(ТекущиеДанные.Основание) Тогда
				
				ОткрытьЗначение(ТекущиеДанные.Основание);
				
			ИначеЕсли Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "НомерДатаПоручения" 
				И ЗначениеЗаполнено(ТекущиеДанные.Поручение) Тогда
				
				ОткрытьЗначение(ТекущиеДанные.Поручение);
				
			ИначеЕсли Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "Статус" Тогда
				
				Если ЗначениеЗаполнено(ТекущиеДанные.Основание) Тогда
					ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности",Новый Структура("ОбъектОтбора", ТекущиеДанные.Основание),, ТекущиеДанные.Основание.УникальныйИдентификатор());
				ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Поручение) Тогда
					ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности",Новый Структура("ОбъектОтбора", ТекущиеДанные.Поручение),, ТекущиеДанные.Поручение.УникальныйИдентификатор());	
				КонецЕсли;

			КонецЕсли;
			
		ИначеЕсли ИмяТаблицы = "ПорученияКлиентов" Тогда
			
			Если ЗначениеЗаполнено(ТекущиеДанные.Поручение) Тогда
			
				Если Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "Статус" Тогда
					
					ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности",Новый Структура("ОбъектОтбора", ТекущиеДанные.Поручение),, ТекущиеДанные.Поручение.УникальныйИдентификатор());	
					
				ИначеЕсли Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "ДатаИсполненияС" 
					Или Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "ДатаИсполненияПо"
					Или Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "НомерВходящегоДокумента"
					Или Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "ДатаВходящегоДокумента" Тогда
					
					ОткрытьЗначение(ТекущиеДанные.Поручение);
					
				КонецЕсли; 
				
			КонецЕсли;
			
		ИначеЕсли ИмяТаблицы = "ПорученияНаПереводДенежныхСредств" Тогда
			
			Если ЗначениеЗаполнено(ТекущиеДанные.Поручение) Тогда
			
				Если Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "Статус" 
					И ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПорученийНаПереводДенежныхСредств.ОжидаетАкцепта") Тогда
					
					Если Вопрос("Вы хотите акцептовать поручение?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда

						СтруктураЗаполнения = Новый Структура("Объект", ТекущиеДанные.Поручение);
						ФормаДокумента = ПолучитьФорму("Документ.Акцепт.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения), ЭтаФорма);
						ФормаДокумента.Открыть();
						
					КонецЕсли;
					
				ИначеЕсли Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "СтатусПеревода" Тогда
                	ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности",Новый Структура("ОбъектОтбора", ТекущиеДанные.Поручение),, ТекущиеДанные.Поручение.УникальныйИдентификатор());
				Иначе
					ОткрытьЗначение(ТекущиеДанные.Поручение);	
				КонецЕсли; 
								
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Отказ = Истина;			
						
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхПередНачаломИзменения(Элемент, Отказ)
	
	ТаблицаДанныхОбработкаНажатия(Элемент, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура СтатусВнутреннегоПорученияПриИзменении(Элемент) 
	
	УстановитьОтборСтрок("ВнутренниеПорученияНаВывод");
	
КонецПроцедуры 

&НаКлиенте
Процедура СтатусПорученияКлиентаПриИзменении(Элемент)
	
	УстановитьОтборСтрок("ПорученияКлиентов");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗадолженностиВнутренниеПорученияПриИзменении(Элемент)
	
	УстановитьОтборСтрок("ВнутренниеПорученияНаВывод");
	
КонецПроцедуры 

&НаКлиенте
Процедура ТипЗадолженностиПорученияКлиентаПриИзменении(Элемент)
	
	УстановитьОтборСтрок("ПорученияКлиентов");	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПорученияНаПереводПриИзменении(Элемент)

	УстановитьОтборСтрок("ПорученияНаПереводДенежныхСредств");
	
КонецПроцедуры 

&НаКлиенте
Процедура ГруппаСтраницыПорученийНаВыводПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ЭтаФорма.Статус = Неопределено;
	ЭтаФорма.ВидЗадолженности = Неопределено;
	
	УстановитьОтборСтрок("ПорученияКлиентов");
	УстановитьОтборСтрок("ВнутренниеПорученияНаВывод");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрок(ИмяТаблицы);
	
	ПоляОтбора = "";
	
	Если ИмяТаблицы = "ПорученияКлиентов" Тогда 
		
		Если ЗначениеЗаполнено(ЭтаФорма.Статус) Тогда	
			ПоляОтбора = ?(ПоляОтбора = "", "", ПоляОтбора + ", ") + "Статус";	
		КонецЕсли;
			
		Если ЗначениеЗаполнено(ЭтаФорма.ТипЗадолженности) Тогда	
			ПоляОтбора = ?(ПоляОтбора = "", "", ПоляОтбора + ", ") + "ТипЗадолженности";	
		КонецЕсли;
			
	ИначеЕсли ИмяТаблицы = "ВнутренниеПорученияНаВывод" Тогда
				
		Если ЗначениеЗаполнено(ЭтаФорма.Статус) Тогда	
			ПоляОтбора = ?(ПоляОтбора = "", "", ПоляОтбора + ", ") + "Статус";	
		КонецЕсли;
			
		Если ЗначениеЗаполнено(ЭтаФорма.ВидЗадолженности) Тогда	
			ПоляОтбора = ?(ПоляОтбора = "", "", ПоляОтбора + ", ") + "ВидЗадолженности";	
		КонецЕсли;
		
	ИначеЕсли ИмяТаблицы = "ПорученияНаПереводДенежныхСредств" Тогда
		
		Если ЗначениеЗаполнено(ЭтаФорма.ТипПорученияНаПеревод) Тогда	
			ПоляОтбора = ?(ПоляОтбора = "", "", ПоляОтбора + ", ") + "ТипПорученияНаПеревод";	
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура(ПоляОтбора);
	
	Для Каждого ЭлементОтбора Из СтруктураОтбора Цикл
		
		СтруктураОтбора[ЭлементОтбора.Ключ] = ЭтаФорма[ЭлементОтбора.Ключ];
		
	КонецЦикла;

	Элементы[ИмяТаблицы].ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	Если ИмяСобытия = "ИсполнениеПоручений.Обновить" Тогда
		ОбновитьТаблицыПорученийНаВыводНаСервере();
	ИначеЕсли ИмяСобытия = "ПорученияНаПереводДС.Обновить" Или ИмяСобытия = "ЗаписьАкцепта" Тогда
		ОбновитьТаблицуПорученийНаПереводНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПорученийНаПереводПриИзменении(Элемент)
	
	ОбновитьТаблицуПорученийНаПереводНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУведомленияОНамерении(Команда)
	
	МассивПоручений = Новый Массив;
	
	ТекСчетДУ = Неопределено;
	
	Для Каждого ТекСтрока Из ЭтаФорма.ПорученияНаПереводДенежныхСредств Цикл 
		
		Если Не ТекСтрока.Флажок Тогда
			Продолжить;	
		КонецЕсли;

		ТекСчетДУ = ?(ТекСчетДУ = Неопределено, ТекСтрока.СчетДоверительногоУправления, ТекСчетДУ);  
				
		Если ТекСчетДУ <> ТекСтрока.СчетДоверительногоУправления Тогда  
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать уведомления о намерении возможно в рамках только одного счета ДУ.");
			Возврат;
		КонецЕсли;
		
		МассивПоручений.Добавить(ТекСтрока.Поручение);
		
	КонецЦикла; 
	
	ПараметрыФормы = Новый Структура("МассивДокументов, ПорученияНаПереводСоСчетовБрокера", МассивПоручений); 
	
	Если МассивПоручений.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны поручения для печати уведомлений.");
		Возврат;
	Иначе
		ОткрытьФорму("Обработка.ПечатьМНО.Форма.ФормаПечатьУведомленияОНамерении", ПараметрыФормы, ЭтаФорма);		
	КонецЕсли;	
	
КонецПроцедуры
